{
  "posts": [
    {
      "id": 1,
      "remove": false,
      "date": "15/10/2024",
      "title": "Análise do game Red Dead Redemption II",
      "description": "Estados Unidos, 1899. O fim da era do velho oeste começou. Depois de tudo dar errado durante um roubo em uma cidade do oeste chamada Blackwater, Arthur Morgan e a gangue Van der Linde são forçados a fugir. Com agentes federais e os melhores caçadores de recompensas no seu encalço, a gangue precisa roubar, assaltar e lutar para sobreviver no impiedoso coração dos Estados Unidos. Conforme divisões internas profundas ameaçam despedaçar a gangue, Arthur deve fazer uma escolha entre os seus próprios ideais e a lealdade à gangue que o criou.",
      "post": "Red Dead Redemption II é mais do que um jogo — é uma experiência cinematográfica e imersiva que conquistou milhões de fãs ao redor do mundo. Com gráficos impressionantes, uma narrativa rica e um mundo aberto detalhado, não é surpresa que o jogo tenha alcançado a marca de 46 milhões de cópias vendidas. Neste post, analisamos o impacto cultural e comercial do título, bem como a incrível trajetória da franquia Red Dead, que já acumulou 70 milhões de unidades vendidas. Descubra o que torna este épico da Rockstar tão especial para os jogadores. <br> Lançamento no PC: Red Dead Redemption 2 para PC aproveita ao máximo a potência do PC para dar vida a cada canto deste mundo gigantesco, rico e detalhado. Desde os picos nevados e ventosos das montanhas de Grizzlies até as estradas empoeiradas de Lemoyne; desde as vitrines sujas de lama em Valentine até as ruas de paralelepípedo de St. Denis. Novas melhorias gráficas e técnicas para tornar o jogo mais imersivo incluem maiores distâncias de renderização para melhor navegação; iluminação global de maior qualidade e oclusão do ambiente para melhorar a iluminação do dia e da noite; rastros de maior qualidade na neve, melhorias nos reflexos e sombras mais fortes e de maior resolução a todas as distâncias; texturas de árvore tesseladas e melhorias nas texturas de grama e pelos, tornando todas as plantas e animais mais realistas. <br> Requisitos Mínimos no PC <br> SO: SO: Windows 10 - 64-bit <br> Armazenamento: 150 GB <br> Processador: Intel® Core™ i5-2500K / AMD FX-6300 <br> Memória: 8 GB <br> Placa de vídeo: Nvidia GeForce GTX 770 2GB / AMD Radeon R9 280 3GB <br> Placa de som: Compatível com DirectX",
      "image": "https://cdn1.epicgames.com/b30b6d1b4dfd4dcc93b5490be5e094e5/offer/RDR2476298253_Epic_Games_Wishlist_RDR2_2560x1440_V01-2560x1440-2a9ebe1f7ee202102555be202d5632ec.jpg"
    },
    {
      "id": 2,
      "remove": false,
      "date": "05/12/2024",
      "title": "Skyrim o jogo mais amado da história? Isso é o que veremos nesse post!",
      "description": "A história do jogo acontece cerca de 200 anos após os eventos de Oblivion, durante o ano 201 da 4th Era (4E201). O High King of Skyrim foi morto, e uma guerra civil ocorreu por toda a região. De um lado, os que desejavam se separar do império agora em ruínas. Do outro, os que ainda queriam permanecer como parte dele, acreditando na preservação de valores. Para piorar a situação, uma profecia de Elder Scrolls anunciava o retorno dos dragões de Alduin, o deus nórdico da destruição.",
      "post": "Skyrim é um jogo de RPG que mantém a tradicional jogabilidade de mundo aberto encontrada na série The Elder Scrolls. O jogador é livre para andar pela terra de Skyrim a sua vontade. <br> Em Skyrim há nove grandes 'posses', com nove capitais que são as principais cidades do jogo. Também há várias pequenas aldeias, cavernas, templos, fazendas e montanhas. Cada vilarejo e cidade possui sua própria economia, que o jogador pode manipular ou sabotar se escolher fazer isso. Ao visitar as cidades, o jogador pode completar atividades como cozinhar, agricultura, cortar madeira e criar itens de metal na forja mais próxima, como também aceitar trabalhos (chamados de 'Quests') para ganhar dinheiro. <br> Qualquer trabalho que um NPC pode realizar também pode ser feito pelo jogador. O nível do jogador aumenta quando suas habilidades aumentam. Dezoito habilidades estão presentes em Skyrim, e o sistema de classes de Oblivion foi removido. <br> Perks (ou bônus) são capacidades específicas de cada habilidade, organizada em um sistema de grupo de ramificações chamado de 'árvores de Perks'. Cada aumento de nível permite que outro benefício seja escolhido. Existem 280 perks (ou bônus), e agora é possível passar do nível 81, mas depois disso a taxa de aumento das habilidades é reduzida. <br> O HUD na tela apenas aparece quando a vida, energia ou mágica do jogador estão se esgotando. Itens e esquemas de equipamentos podem ser salvos por um menu de rápido acesso, e o menu de inventário na tela de pause é apresentado em uma sobreposição em estilo bússola; enquanto que no inventário, o jogador pode girar e se aproximar dos itens adquiridos. <br> Durante a Era Meretica, um lendário líder Atmoran chamado Ysgramor, liderou uma expedição de Atmora para a terra a qual seria conhecida posteriormente como Skyrim. Eles a chamaram primeiramente de Mereth, em reconhecimento a grande quantidade de Mer que viviam ali. Foi a primeira região de Tamriel a ser habitada por humanos que migraram das terras de Atmora, no extremo norte, através do Mar dos Fantasmas. De acordo com a lenda, Ysgramor se estabeleceu primeiro em Hsaarik Head, no extremo norte da Broken Cape. Dizem que ele e seus companheiros estavam fugindo da Guerra Civil em Atmora, que na época tinha uma população considerável. <br> Requisitos Mínimos no PC: Dual core/AMD Athlon X2 2.0Ghz <br> 2GB de memória <br> NVIDIA 8600 GT/ATI HD 3650 512MB <br> 6GB de espaço em disco <br> Windows XP, Vista, 7.",
      "image": "https://wallpapers.com/images/hd/skyrim-desktop-ufe88ts1145qerk9.jpg"
    },
    {
      "id": 3,
      "remove": false,
      "title": "O que é a stack MERN?",
      "date": "06/12/2024",
      "description": "A stack MERN é uma combinação de tecnologias que permite a desenvolvimento de aplicativos web full-stack, incluindo o front-end (HTML, CSS e JavaScript) e o back-end (Node.js, Express.js e MongoDB). Se o assunto de desenvolvimento e programação é do seu interesse, veja mais nesse artigo.",
      "post": "Uma das principais vantagens Como todos os componentes do conjunto são em Javascript, as aplicações feitas com MEAN podem ser escritas usando a mesma linguagem tanto no back-end(lado do servidor) como no front-end(lado do cliente). <br> Embora seja frequentemente comparado com outros conjuntos de solução para desenvolvimento web, como o LAMP (Linux, Apache, MariaDB/MySQL e PHP), os componentes do MEAN são mais próximos da programação de alto nível, pois incluem uma ferramenta para camada de apresentação da aplicação, e não incluem uma camada de sistema operacional. A sigla MEAN foi usada pela primeira vez por pelo desenvolvedor Valeri Karpov que em 2013 introduziu o termo em seu Blog. A logo, criada pelo designer gráfico Austin Anderson para o grupo original de desenvolvedores MEAN no LinkedIn, foi feita juntando as primeiras letras das logos de cada um dos componentes do conjunto MEAN. <br> Todas as opções de Stack oferecem funcionalidades únicas para os desenvolvedores, tornando difícil escolheruma delas a melhor ou mais indicada para todos. Como a diferença está principalmente na utilização do framework para desenvolvimento front-end, é preciso conhecer cada uma das tecnologias (Angular, React e Vue) para poder determinar qual é a mais indicada para a programação. <br> Porém, é fato que o MEAN Stack é uma das abordagens mais utilizadas atualmente. Grandes organizações recorrem a esse conjunto de ferramentas, tais como HBO, Nike e YouTube no desenvolvimento de suas aplicações web. Já o MERN tem sido a opção das organizações que apostam pesado na experiência de usuário, como Netflix, Uber e Flipkart. Isso significa que também é uma boa opção. <br> Em um stack específico, todas as tecnologias trabalham em conjunto para oferecer a melhor experiência e resultados para o desenvolvimento de uma aplicação. Além disso, a divisão em “pacote de ferramentas” ajuda na tomada de decisão sobre qual opção escolher, já que ao optar por uma abordagem específica, todo o restante “vem junto”.",
      "image": ""
    },
    {
      "id": 4,
      "remove": false,
      "title": "O que é React ? Para que serve a tão falada biblioteca Frontend?",
      "date": "08/12/2024",
      "description": "React é uma biblioteca javascript, sua principal vantagem é conseguir separar o código em 'componentes' nos dando mais flexibilidade para o desenvolvimento.",
      "post": "React é uma biblioteca JavaScript (JS). Ou seja, essa é a principal linguagem de programação que ele utiliza. e é utilizado para a criação de user interfaces (UI). <br> O React permite que você crie interfaces de usuário a partir de peças individuais chamadas de componentes. Crie seus próprios componentes React como 'Thumbnail', 'LikeButton', e Video. Em seguida, combine-os em telas inteiras, páginas, e aplicativos. <br> As principais linguagens utilizadas no React, JavaScript e HTML costumam ser as primeiras a serem dominadas no aprendizado de programação. O JSX, que utiliza princípios de ambas as linguagens e por ser muito parecido com o HTML, também é de fácil aprendizado. <br> Para que servem os famosos Hooks: eles resolvem uma grande variedade de problemas encontrados durante o desenvolvimento de componentes. <br> Por exemplo: <br> - Reutilização de lógica de estado entre components. <br> - Componentes contendo grandes responsabilidades; <br> - Componentes complexos e difíceis de se compreender, entre outros. <br> Com o React podemos usar o Typescript também, pois ele já conta com um bom suporte ao TSX.",
      "image": "https://miro.medium.com/v2/resize:fit:1400/1*vHHBwcUFUaHWXntSnqKdCA.png"
    }
  ]
}